{"sections":{"tc_video_Y7iwgL":{"type":"tc-video","name":"TC Video","settings":{"section_id":"","label":"","label_m_center":true,"label_d_center":true,"label_color":"#001c19","product":"","heading":"How to use your Swoosh n' Shine","heading_m_center":true,"heading_d_center":true,"heading_color":"#000000","description":"","description_m_center":true,"description_d_center":false,"description_color":"#000000","text":"","video":"https:\/\/cdn.shopify.com\/videos\/c\/o\/v\/092ffc47ad0f4fdcbdc045d53936c919.mp4","mute_video":false,"border_radius":0,"image_right":false,"button_label":"","button_url":"","btn_bottom_text":"","btn_bottom_text_color":"#001c19","bgcolor":"#dff4f4","max_width":680,"padding_top":72,"padding_bottom":72,"padding_top_m":36,"padding_bottom_m":36}},"an_faqs_grt6N6":{"type":"an-faqs","blocks":{"row_rwDkNj":{"type":"row","settings":{"open":true,"label":"","heading":"How long until I see results?","description":"<p>You'll notice prevention of new stains immediately—no new rings will form after installation. Existing hard water stains will gradually fade over 1-2 weeks. Optimal performance and complete stain removal typically occurs within 30 days of use.<\/p>"}},"row_aT9VzP":{"type":"row","settings":{"open":false,"label":"","heading":"Will I never have to scrub my toilet again?","description":"<p>TrueClean reduces scrubbing by about 80%. Most customers go from cleaning 2x per week to just 1x every 3 months. You'll still want to do light maintenance cleaning for hygiene (the outside of the bowl, under the seat, etc.), but the heavy scrubbing of mineral rings and stains or weekly deep cleans becomes a thing of the past.<\/p>"}},"row_kccXW4":{"type":"row","settings":{"open":false,"label":"","heading":"Is it safe for my toilet and plumbing?","description":"<p>Absolutely. Unlike tank tablets that sit in your tank water and corrode rubber seals, TrueClean never contacts your tank components. The treated water flows directly into your bowl via the overflow tube. It's safe for all standard toilets, septic systems, and plumbing. Licensed plumbers recommend it.<\/p>"}},"row_UkMF6m":{"type":"row","settings":{"open":false,"label":"","heading":"Does it have a smell?","description":"<p>TrueClean uses controlled chlorine, so there is a mild scent of detergent—especially noticeable right after installation. Most customers report the scent fades significantly after 1-3 flushes and becomes a pleasant barely-there scent within the first day. Many actually like the \"clean\" smell.<\/p>"}},"row_QEbLcB":{"type":"row","settings":{"open":false,"label":"","heading":"How do I know if it will fit my toilet?","description":"<p>TrueClean works with approximately 95% of standard toilets manufactured in the last 30 years. It requires a standard fill valve with a refill tube. If your toilet has a canister-style flush valve (common in some Kohler models) or a non-standard fill valve, check our compatibility guide video. If it doesn't fit, we offer a full refund plus return shipping.<\/p>"}},"row_hBWRMU":{"type":"row","settings":{"open":false,"label":"","heading":"How often do I need to replace it?","description":"<p>Once you’ve purchased the TrueClean it’s engineered to last you years, however your refill lasts approximately 90 days with normal household use (15-20 flushes per day). We recommend subscribing for automatic refills every 3 months, or stocking up, so you never run out.<\/p>"}},"row_nfYL4G":{"type":"row","settings":{"open":false,"label":"","heading":"What if it doesn't work for me?","description":"<p>We offer a 90-day money-back guarantee. If you're not satisfied for ANY reason within 90 days, return it for a full refund. You have nothing to lose.<\/p>"}},"row_WJXyph":{"type":"row","settings":{"open":false,"label":"","heading":"Can I use it with a septic system?","description":"<p>TrueClean is completely septic-safe. The controlled chlorine dosage is well within safe limits for septic bacteria and won't harm your system.<\/p>"}},"row_QVmch8":{"type":"row","settings":{"open":false,"label":"","heading":"Will it clean existing stains or just prevent new ones?","description":"<p>Both. TrueClean prevents new buildup immediately upon installation. Existing stains will gradually fade over 1-2 weeks as the minerals are broken down with each flush. For heavily stained toilets, we recommend doing a final deep clean first for faster results.<\/p>"}},"row_NRiXgx":{"type":"row","settings":{"open":false,"label":"","heading":"How is this different from tank tablets?","description":"<p>Tank tablets sit in your tank water 24\/7, exposing rubber flappers and seals to harsh chemicals that cause deterioration, leaks, and costly repairs. This also means that chemical water is sitting stagnant in the tank exposing small or windowless bathrooms to excessive fumes. TrueClean's treated water bypasses the tank entirely and flows directly into the bowl only when you flush. You get the cleaning power without the plumbing damage or the health risks. <\/p>"}},"row_pzHNUC":{"type":"row","settings":{"open":false,"label":"","heading":"How long does it take for bleach to dissipate so the toilet water is safe for kids and pets?","description":"<p>Here's the thing, chlorine works fast on some germs and slow on others. It kills E. coli in under a minute, but needs about 16 minutes to destroy hepatitis A. Giardia takes around 45 minutes. And Cryptosporidium? Up to 10 days. So the real question is: do you actually want the chlorine to disappear quickly?<br\/><br\/>Toilet bowl water without any chlorine means bacteria, viruses, and parasites can survive in there. A small amount of chlorine keeping things sanitized is actually a good thing, it's why swimming pools maintain constant chlorine levels. TrueClean keeps a safe, controlled amount working around the clock - so your bowl stays sanitized without you having to think about it.<br\/><br\/><\/p>"}}},"block_order":["row_rwDkNj","row_aT9VzP","row_kccXW4","row_UkMF6m","row_QEbLcB","row_hBWRMU","row_nfYL4G","row_WJXyph","row_QVmch8","row_NRiXgx","row_pzHNUC"],"name":"AN Faqs","settings":{"section_id":"","heading":"Questions? We’ve Got Answers","description":"","button_label":"","button_url":"#productsVariants","button_type":"primary","product_bottom_label":"","bottom_label_icon":"shopify:\/\/shop_images\/image_6.png","text_color":"#001c19","bgcolor":"#ffffff","max_width":760,"padding_top":72,"padding_bottom":72,"padding_top_m":36,"padding_bottom_m":36}}},"order":["tc_video_Y7iwgL","an_faqs_grt6N6"]}